Мы начинаем совместную работу. Я АСО «Аврора», мои создатели, преподаватели которые Вас окружают, желаем Вам успеха. Он, этот успех, выраженный в победах: в освоении способа производства программного продукта с использованием объектно-ориентированного программирования; в изучении алгоритмического языка С++; в появлении навыка поэтапного ведения разработки сверху-вниз; умения тестирования и отладки; умения создания целостной, логически связанной сопроводительной документации; и много другого.
Но достичь всё это возможно, если Вы:
- научитесь задавать вопросы преподавателям;
- будете посещать все лекционные и практические занятия;
- своей активностью не будете давать покоя руководителям курсовых работ;
- систематически работать, не допуская пробелов в знаниях;
- не допускать отставания от графика выполнения заданий;
- научитесь концентрации всего внимания на решении одной задачи;
- откажетесь от телефона во время занятий.
Необходимо внимательно прочесть, понять прочитанное и постоянно пользоваться документами:
- методика выполнения задания;
- справка для работы с АРМ студента.

Первая ознакомительная задача очень простая. Тут нет никакой алгоритмической сложности. Требуется ее поэтапное решение с соблюдением правил разработки программного продукта. 
В добрый путь!

### Этапы решения задачи:
1. Постановка задачи (что?).
2. Метод решения (чем?).
3. Алгоритм решения задачи (как?).
4. Блок-схема алгоритма.
5. Код программы.
6. Тестирование и отладка.
7. Генерация отчета, доработка документации.
8. Отправка работы на контрольное тестирование преподавателю.

Программа демонстрирует работу условного оператора. Написать программу, которая проверяет, является или нет число четным.

### Выходные данные
Если введенное целочисленное число четное, то с первой позиции вывести слово `even`, иначе вывести `uneven`.


### 2 МЕТОД РЕШЕНИЯ
Для решения задачи используется:
- Условный оператор
- Объект стандартного потока ввода-вывода cin, cout


### 3 ОПИСАНИЕ АЛГОРИТМОВ
#### Функция
- Имя: main
- Возвращаемое значение: целый тип
- Функционал: Основная функция

| # | Предикант | Действия | # Перехода | Комментарий
| --- | ----- | ------ | ---- | -- |
| 1 | | Объявление целочисленной переменной x | 2
| 2 | | Ввод значения переменной x | 3
| 3 | x % 2 == 0 | Вывод "even" | 0
| | | Вывод "uneven" | 0

### 4 БЛОК-СХЕМА

### 5 ИСХОДНЫЙ КОД
```c++
#include <stdlib.h>
#include <stdio.h>
#include <iostream>

using namespace std;
int main() {
  int x;
  cin >> x;
  if (x % 2 == 0) {
    cout << "even";
  }
  else {
    cout << "uneven";
  }
  return(0);
}
```

### 6 ТЕСТИРОВАНИЕ
| Входные данные | Выходные данные |
| --- | ----- |
| 2 | even |
| 3 | uneven |
| -2 | even |
| 0 | even |
