## 2_2_1 Доступ к элементам объекта (НЕ СДЕЛАНО!)
### Введение
Конструктивно объект согласно описанию, состоит их элементов. Каждый элемент реализует свойство или функционал. Часть элементов доступно извне. Посредством этого доступа меняется значение свойства или отрабатывает определенный функционал. Множество таких элементов представлены в разделе `public` для описания класса. Это множество элементов реализует интерфейс общения с объектом. 

Другая часть элементов являются скрытыми. К этим элементам нет непосредственного доступа извне. При отработке доступного функционала меняются значения скрытых элементов и скрытые функциональные элементы выполняют часть отрабатываемого алгоритма.

Метафора реального объекта - телефон. Сенсорный экран, кнопки и разъёмы реализуют интерфейс для общения (воздействия) с телефоном. Эти воздействия меняют состояние (значения свойств) телефона и выполняют определенные действия (реализуют функционал, запускают приложения). При отработке функционала участвуют и скрытые элементы, которые непосредственно извне не доступны (процессор, оперативная память и т.д.). 

Взаимодействие доступных и скрытых элементов реализовано в алгоритмах описания методов класса.

Синтаксис взаимодействия с доступными элементами объекта:
```c++
"индентификатор объекта" . "наименование элемента" [([аргументы])]
```

или посредством указателя:
```c++
"индентификатор указателя на объект" -> "наименование элемента"[([аргументы])]
```

### Постановка задачи
Спроектировать объект, в котором есть доступные и скрытые элементы (свойства и методы). Есть одно доступное свойство целого типа и одно скрытое свойство целого типа.
У объекта есть параметризированный конструктор с параметром целого типа. В конструкторе доступному свойству присваивается значение параметра, а скрытому свойству удвоенное значение параметра.

У объекта есть доступные методы со следующим функционалом:
- Метод изменения значения доступного и скрытого свойства. Доступному свойству добавляется 1, скрытому свойству добавляется 4;
- Метод вызова скрытого метода;
- Метод вывода состояния, выводит значение доступного и скрытого свойства.

У объекта есть один скрытый метод со следующим функционалом:
- метод доступному свойству добавляет 5, скрытому свойству добавляет 7.

Написать программу, которая состоит из описания класса выше представленного объекта и основной функции, в которой реализован следующий алгоритм:
1. Ввод целочисленного значения переменной `i_data`.
2. Создание объекта, параметризированному конструктору в качестве аргумента передается переменная `i_data`.
3. Вывод исходного состояния объекта.
4. Вызов метода изменения значений свойств объекта.
5. Вывод текущего состояния объекта.
6. Ввод целочисленного значения переменной `i_data`.
7. Непосредственное изменение доступного свойства объекта посредством умножения его значения на `i_data`.
8. Вывод текущего состояния объекта.
9. Вызов метода объекта, который вызывает скрытый метод объекта.
10. Вывод текущего состояния объекта.

### Входные данные
Первая строка `Целочисленное значение`
<br>
Вторая строка `Целочисленное значение`

### Выходные данные
Метод вывода состояния, первый вывод делает в первой строке, а далее всегда с новой строки. Шаблон вывода:

Value of the available property `значение доступного свойства`
<br>
Value of a hidden property `значение закрытого свойства`

### 2 МЕТОД РЕШЕНИЯ
Для решения задачи используется:

- Ввод/вывод
- Класс
- Заголовочный файл

Методы:
- Конструктор MyClass
- - Функционал:
- - - Доступное свойство - переменная i_data
- - - Скрытое свойство - переменная i_data * 2
- Вывод состояния print()
- - Функционал: вывод исходного состояния объекта
- Вызов изменения значений свойств объекта change1()
- - Функционал: доступному свойсту добавляет 1, скрытому свойству 4
- Вызов изменения значений свойств объекта change2()
- - Функционал: доступному свойсту добавляет 5, скрытому свойству 7
### 3 ОПИСАНИЕ АЛГОРИТМОВ
#### Функция
- Имя: main
- Возвращаемое значение: целый тип
- Функционал: Основная функция

| # | Предикант | Действия | # Перехода | Комментарий
| --- | ----- | ------ | ---- | -- |
| 1 | | | 2
| 2 | | | 3


### 4 БЛОК-СХЕМА

### 5 ИСХОДНЫЙ КОД
#### main.cpp
```c++
#include <stdlib.h>
#include <stdio.h>
#include <iostream>
#include "221.h"
using namespace std;

int main() {
  int i_data;
  cin >> i_data; // 1 ввод целочисленного значения переменной i_data
  MyClass test = MyClass(i_data); // 2 создание объекта, параметризированному конструктору в качестве аргумента передается переменная i_data
  test.print(); // 3 вывод исходного состояния объекта.
  cout << endl;
  test.change1(); // 4 вызов метода изменения значений свойств объекта.
  test.print(); // 5 вывод текущего состояния объекта.
  cout << endl;
  cin >> i_data; // 6 ввод целочисленного значения переменной i_data.
  test.publicProp = test.publicProp * i_data; // 7 непосредственное изменение доступного свойства объекта посредством умножения его значения на i_data.
  test.print(); // 8 вывод текущего состояния объекта.
  cout << endl;
  test.call(); // 9 вызов метода объекта, который вызывает скрытый метод объекта.
  test.print(); // 10 вывод текущего состояния объекта.
  return(0);
}
```

#### 221.h
```c++
#ifndef MYCLASS_H
#define MYCLASS_H
using namespace std;

class MyClass {
  public:
    MyClass(int i_data) {
      publicProp = i_data;
      privatProp = i_data * 2;
    }
    int publicProp; // доступное свойство
    void print() { // метод вывода состояния
      cout << "Value of the available property " << publicProp << endl;
      cout << "Value of a hidden property " << privatProp << endl;
    }
    void change1() { // метод изменения значения доступного и скрытого свойства
      publicProp += 1; // доступное свойство
      privatProp += 4; // скрытое свойство
    }
    void call() { // метод вызова скрытого метода;
      this -> change2();
    }
  private:
    int privatProp; // скрытое свойство
    void change2() { // метод доступному свойству добавляет 5, скрытому свойству добавляет 7
      publicProp += 5; // доступное свойство
      privatProp += 7; // скрытое свойство
    }
};

#endif
```

### 6 ТЕСТИРОВАНИЕ
| Входные данные | Выходные данные |
| --- | ----- |
|  |  |
|  |  |
