## 2_2_2 Доступ к элементам

### Постановка задачи
Спроектировать объект, в котором есть доступные и скрытые элементы (свойства и методы). Есть одно доступное свойство целого типа и одно скрытое свойство целого типа. У объекта есть параметризированный конструктор с параметром целого типа. В конструкторе доступному свойству присваивается значение параметра, а скрытому свойству **утроенные** значения параметра.

У объекта есть доступные методы со следующим функционалом:
- метод изменения значения доступного и скрытого свойства. Доступному свойству добавляется **4**, скрытому свойству добавляется **1**
- метод вызова **закрытого** метода
- метод **вызова** состояния, выводит значение доступного и скрытого свойства

У объекта есть один скрытый метод со следующим функционалом:
- метод доступному свойству добавляется **7**, скрытому свойству добавляется **5**

Написать программу, которая состоит из описания класса выше представленного объекта и основной функции, в которой реализован следующий алгоритм:
1. Ввод целочисленного значения переменной `i_data`
2. **Создание объекта** посредством оператора функции `new` и исползьовании указателя на объект, параметризованному конструктору в качестве аргумента передается переменная `i_data`
3. Вывод исходного состояния объекта
4. Вызов метода изменения значений свойств объекта
5. Вывод текушего состояния объекта
6. Ввод целочисленного значения переменной `i_data`
7. **Если значения `i_data` > `значения доступного свойства объекта`**, то

7.1. Присвоение доступному свойству объекта значения выражения `i_data * 8` и переход к пункту 9

8. Иначе

8.1 Переход к пункту 9

9. Вывод текущего состояния объекта
10. Вызов метода объекта, который вызывает секретный скрытый метод объекта 
11. Вывод текушего состояния объекта

### Входные данные
Первая строка: `целочисленное значение`
<br>
Вторая строка: `целочисленное значение`

### Выходные данные
Метод вызова состояния, первый вывод делает в первой строке, а далее с новой.

Шаблон вывода:
<br>
Value of the available property `значение доступного свойства`; Value of a hidden property `значение закрытого свойства`

### 2 МЕТОД РЕШЕНИЯ
Для решения задачи используется:
- Класс
- Оператором цикла
- Условный оператор
- Объект стандартного потока ввода-вывода cin, cout
- Заголовочный файл

Методы:
- Конструктор MyClass
- - Функционал:
- - - Доступное свойство - переменная i_data
- - - Скрытое свойство - переменная i_data * 3
- Вывод состояния print()
- - Функционал: вывод исходного состояния объекта
- Вызов изменения значений свойств объекта change1()
- - Функционал: доступному свойсту добавляет 4, скрытому свойству 1
- Вызов изменения значений свойств объекта change2()
- - Функционал: доступному свойсту добавляет 7, скрытому свойству 5

### 3 ОПИСАНИЕ АЛГОРИТМОВ
#### Функция
- Имя: main
- Возвращаемое значение: целый тип
- Функционал: Основная функция

| # | Предикант | Действия | # Перехода | Комментарий
| --- | ----- | ------ | ---- | -- |
| 1 | | Ввод целочисленной переменной i_data | 2
| 2 | | Создание объекта, параметризированному конструктору в качестве аргумента передается переменная i_data | 3
| 3 | | Вывод исходного состояния объекта | 4
| 4 | | Вызов метода изменения значений свойств объекта | 5
| 5 | | Вывод текущего состояния объекта | 6
| 6 | | Ввод целочисленного значения переменной i_data | 7
| 7 | i__data > test.publicProp | | 8 |
| | | | 9
| 8 | | Присвоение доступному свойству объекта значения выражения i_data * 8 и переход к пункту 9 | 9
| 9 | | Вывод текущего состояния объекта | 10
| 10 | | Вызов метода объекта, который вызывает секретный скрытый метод объекта | 11
| 11 | | Вывод текущего состояния объекта | 0

#### Конструктор
- Класс объекта: MyClass
- Модификатор: public
- Параметры: i_data
- Функционал: создание объекта

| # | Предикант | Действия | # Перехода | Комментарий
| --- | ----- | ------ | ---- | -- |
| 1 | | Создание объекта MyClass с помощью конструктора | 2
| 2 | | Объявление переменной publicProp = i_data | 3
| 3 | | Объявление переменной privatProp = i_data * 3 | 4
| 4 | | Объявление доступного свойства | 5
| 5 | | Метод вывода состояния | 6
| 6 | | Метод изменения значения доступного и скрытого свойства | 7
| 7 | | Метод вызова скрытого метода | 8
| 8 | | Объявление скрытого свойства | 9
| 9 | | Метод изменения значения доступного и скрытого свойства | 0


### 4 БЛОК-СХЕМА

### 5 ИСХОДНЫЙ КОД
**main.cpp**

```c++
#include <stdlib.h>
#include <stdio.h>
#include <iostream>
#include "222.h"
using namespace std;

int main() {
  int i_data;
  cin >> i_data; // 1 ввод целочисленного значения переменной i_data
  MyClass* test = new MyClass(i_data); // Создание объекта посредством оператора функции new и использовании указателя на объект, параметризованному конструктору в качестве аргумента передается переменная i_data
  (*test).print(); // 3 вывод исходного состояния объекта.
  cout << endl;
  (*test).change1(); // 4 вызов метода изменения значений свойств объекта.
  (*test).print(); // 5 вывод текущего состояния объекта.
  cout << endl;
  cin >> i_data; // 6 ввод целочисленного значения переменной i_data.
  if (i_data > (*test).publicProp) // 7 Если значения i_data > значения доступного свойства объекта, то
    (*test).publicProp = i_data * 8; // 7.1 Присвоение доступному свойству объекта значения выражения i_data * 8 и переход к пункту 9
  (*test).print(); // 9 вывод текущего состояния объекта.
  cout << endl;
  (*test).call(); // 10 вызов метода объекта, который вызывает секретный скрытый метод объекта.
  (*test).print(); // 11 вывод текущего состояния объекта.
  return(0);
}
```

**222.h**

```c++
#ifndef MYCLASS_H
#define MYCLASS_H
using namespace std;

class MyClass {
  public:
    MyClass(int i_data) {
      publicProp = i_data;
      privatProp = i_data * 3;
    }
    int publicProp; // доступное свойство
    void print() { // метод вывода состояния
      cout << "Value of the available property " << publicProp << "; " << "Value of a hidden property " << privatProp;
    }
    void change1() { // метод изменения значения доступного и скрытого свойства
      publicProp += 4; // доступное свойство
      privatProp += 1; // скрытое свойство
    }
    void call() { // метод вызова скрытого метода;
      this -> change2();
    }
  private:
    int privatProp; // скрытое свойство
    void change2() { // метод доступному свойству добавляет 5, скрытому свойству добавляет 7
      publicProp += 7; // доступное свойство
      privatProp += 5; // скрытое свойство
    }
};

#endif
```
### 6 ТЕСТИРОВАНИЕ
| 1 <br> 2 | Value of the available property 1; Value of a hidden property 3 Value of the available property 5; Value of a hidden property 4 Value of the available property 5; Value of a hidden property 4 Value of the   available property 12; Value of a hidden property 9 |
