## 3_1_2 Оператор присвоения объектов
Дан объект следующей конструкции:
- В **закрытом** доступе имеется указатель на массив целого типа. Конструктору объекта передается целочисленный параметр. Параметр должен иметь значение больше 4. По значению параметра определяется размерность целочисленного **массива из закрытой области** и каждому элементу присваивается это же значение.   
- Объект имеет функциональность, по которой выводит содержимое целочисленного массива. Вывод производит последовательно, разделяя значения двумя пробелами.  

**Функциональность объекта можно расширить по усмотрению разработчика не более чем на два метода.** Спроектировать систему, которая содержит два объекта. Для построения системы последовательно, с новых строк вводятся целочисленные значения. Если очередное введенное значение меньше или равно 4, то создание системы прекращается, выводится сообщение и программа завершает работу. Если очередное введенное значение больше 4, то посредством параметризованного конструктора создается первый объект, а затем, второй.
  
Далее система функционирует по алгоритму:

1. ...
2. Первому объекту присвоить второй объект.
3. ...  
4. С первой строки вывести содержимое массива первого объекта.
5. ...
6. Со второй строки вывести содержимое массива второго объекта.

### Входные данные
```
5
8
```

### 2 МЕТОД РЕШЕНИЯ
Для решения задачи используется:
- Класс MyClass
- Оператор цикла for
- Условный оператор if
- Объект стандартного потока ввода-вывода cin, cout
- Заголовочный файл

Методы:
- Конструктор MyClass
- - Функционал:
- - - Доступное свойство - переменная sizePrint
- - - Скрытое свойство - контейнер S
- - - Передача параметра size и создание контейнера S, содержащий size количество переменной size
- Вывод состояния print()
- - Функционал: вывод всех значений переменной size


### 3 ОПИСАНИЕ АЛГОРИТМОВ
#### Функция
- Имя: main
- Возвращаемое значение: целый тип
- Функционал: Основная функция

| # | Предикант | Действия | # Перехода | Комментарий
| --- | ----- | ------ | ---- | -- |
| 1 | | Ввод целочисленной переменной size | 2
| 2 | size <= 4 | Вывод "size?" | 0
| | | | 3
| 3 | | Создание объекта, параметризированному конструктору в качестве аргумента передается переменная size | 4
| 4 | | Ввод целочисленной переменной size | 5
| 5 | size <= 4 | Вывод "size?" | 0
| | | | 6
| 6 | | Создание объекта, параметризированному конструктору в качестве аргумента передается переменная size | 7
| 7 | | Вывод текущего состояния объекта | 8
| 8 | | Первому объекту присвоить второй объект | 9
| 9 | | Переход на новую строчку | 10
| 10 | | Вывод текущего состояния объекта | 0

#### Конструктор
- Класс объекта: MyClass
- Модификатор: public
- Параметры: size
- Функционал: создание объекта

| # | Предикант | Действия | # Перехода | Комментарий
| --- | ----- | ------ | ---- | -- |
| 1 | | Объявление переменной sizePrint | 2
| 2 | | Объявление контейнера S | 3
| 3 | | Создание объекта MyClass с помощью конструктора | 4
| 4 | | sizePrint = size | 5
| 5 | | Заполнение контейнера S значениями size | 6
| 6 | i < size | | 7
| | | S.insert(size) | 7              
| 7 | | Вывод текущего состояния объекта | 0

### 5 ИСХОДНЫЙ КОД
**main.cpp**
```c++
#include <iostream>
using namespace std;
#include "311.h"

int main() {
  int size;
  
  cin >> size;
  if (size <= 4) {
    cout << size << "?";
    return 0;
  }  
  MyClass *obj1 = new MyClass(size);
  
  cin >> size;
  if (size <= 4) {
    cout << size << "?";
    return 0;
  }  
  MyClass *obj2 = new MyClass(size);

  (*obj1).print();
  obj1 = obj2;
  cout << endl;
  (*obj1).print(); 
  return(0);
}
```
              
**311.h**
```c++
#ifndef MYCLASS_H
#define MYCLASS_H

class MyClass {
  public:
    int sizePrint;
    MyClass(int size) {
      sizePrint = size;
      arr = new int[size];
      for (int i = 0; i < size; i++) {
        arr[i] = size;
      }
    }
    void print() {
      for(int i = 0; i < sizePrint; i++) {
        if (i != sizePrint - 1)
          cout << arr[i] << "  ";
        else
          cout << arr[i];
      }
   }
  private:
    int *arr;
};
#endif              
```

### 2 вариант (не предпочтительный вариант через контейнер set)
**main.cpp**
```c++
#include <iostream>
#include <set>
using namespace std;
#include "312.h"

int main() {
  int size;
  
  cin >> size;
  if (size <= 4) {
    cout << size << "?";
    return 0;
  }

  MyClass *obj1 = new MyClass(size);
  
  cin >> size;
  if (size <= 4) {
    cout << size << "?";
    return 0;
  }  
  MyClass *obj2 = new MyClass(size);

  (*obj1).print();
  obj1 = obj2;
  cout << endl;
  (*obj1).print(); 
  return(0);
}
```

**312.h**
```c++
#ifndef MYCLASS_H
#define MYCLASS_H

class MyClass {
  public:
    int sizePrint;
    MyClass(int size) {
      sizePrint = size;
      for (int i = 0; i < size; i++) {
        S.insert(size);
      }
    }
    void print() {
      for(int i = 0; i < sizePrint; i++) {
        if (i != sizePrint - 1)
          cout << *(S.begin()) << "  ";
        else
          cout << *(S.begin());
      }
   }
  private:
    set<int> S;
};
#endif
```
