## 3_1_1 Оператор присвоения объектов

<details>
<summary>Введение</summary>
  
Объекты одного класса можно присваивать друг другу. Операция выполняется посредством оператора присвоения. Синтаксис выражения:
 
```c++
«имя объекта 1» = «имя объекта 2»;
```
 
Объекту «имя объекта 1» побитно (поразрядно) присваивается содержимое всех свойств (элементов данных) объекта «имя объекта 2»
  
```c++
#include <iostream>
using namespace std;
 
// ----- Заголовочная часть.
class cl_1 {
private:
    int i;
public:
    void set_i  ( int k );
    void show_i ( );
};
// ----- Часть реализации.
void  cl_1 :: set_i ( int k )
{
    i = k;
}
void  cl_1 :: show_i ( )
{
    cout << “i = “ << i << “\n”;
}
 
// ----- Основная программа
int main ( )
{
    cl_1  ob_1, ob_2;    // объявление объектов
    ob_1.set_i ( 11 );   // инициализация свойства i в ob_1.
    ob_2.set_i ( 15 );   // инициализация свойства i в ob_2.
    ob_1.show_i ( );     // вывод значения свойства объекта ob_1.
    ob_1 = ob_2;         // присвоение объекту ob_1 объекта ob_2.
    ob_1.show_i ( );     // вывод значения свойства объекта ob_1.
    return  0;
}
```

Программа выведет на консоль следующее:
  
```c++
i = 11
i = 15
```
</details>

### Постановка задачи
Дан объект следующей конструкции:
- В открытом доступе имеется указатель на массив целого типа. Конструктору объекта передается целочисленный параметр. Параметр должен иметь значение больше 4. По значению параметра определяется размерность целочисленного массива и каждому элементу присваивается это же значение.   
- Объект имеет функциональность, по которой выводит содержимое целочисленного массива. Вывод производит последовательно, разделяя значения двумя пробелами.  

Спроектировать систему, которая содержит два объекта. Для построения системы последовательно, с новых строк вводятся целочисленные значения. Если очередное введенное значение меньше или равно 4, то создание системы прекращается, выводится сообщение и программа завершает работу. Если очередное введенное значение больше 4, то посредством параметризованного конструктора создается первый объект, а затем, второй.
  
Далее система функционирует по алгоритму:

1. ...
2. Первому объекту присвоить второй объект.
3. ...  
4. С первой строки вывести содержимое массива первого объекта.
5. ...
6. Со второй строки вывести содержимое массива второго объекта.

### Входные данные
```
5
8
```

### 2 МЕТОД РЕШЕНИЯ
Для решения задачи используется:
- Класс MyClass
- Оператор цикла for
- Условный оператор if
- Объект стандартного потока ввода-вывода cin, cout
- Заголовочный файл

Методы:
- Конструктор MyClass
- - Функционал:
- - - Доступное свойство - переменная sizePrint
- - - Доступное свойство - переменная arr
- - - Передача параметра size и создание массива arr, содержащий size количество переменной size
- Вывод состояния print()
- - Функционал: вывод всех значений переменной size

### 3 ОПИСАНИЕ АЛГОРИТМОВ
#### Функция
- Имя: main
- Возвращаемое значение: целый тип
- Функционал: Основная функция

| # | Предикант | Действия | # Перехода | Комментарий
| --- | ----- | ------ | ---- | -- |
| 1 | | Ввод целочисленной переменной size | 2
| 2 | size <= 4 | Вывод "size?" | 3
| | | | 3
| 3 | | Создание объекта, параметризированному конструктору в качестве аргумента передается переменная size | 4
| 4 | | Ввод целочисленной переменной size | 5
| 5 | size <= 4 | Вывод "size?" | 6
| | | | 6
| 6 | | Создание объекта, параметризированному конструктору в качестве аргумента передается переменная size | 7
| 7 | | Вывод текущего состояния объекта | 8
| 8 | | Первому объекту присвоить второй объект | 9
| 9 | | Переход на новую строчку | 10
| 10 | | Вывод текущего состояния объекта | 0

#### Конструктор
- Класс объекта: MyClass
- Модификатор: public
- Параметры: size
- Функционал: создание объекта

| # | Предикант | Действия | # Перехода | Комментарий
| --- | ----- | ------ | ---- | -- |
| 1 | | Объявление переменной sizePrint | 2
| 2 | | Объявление переменной arr | 3
| 3 | | Создание объекта MyClass с помощью конструктора | 4
| 4 | | sizePrint = size | 5
| 5 | | Создание массива arr размерности size | 6
| 6 | i < size | | 7
| | | arr[i] = size; | 7              
| 7 | | Вывод текущего состояния объекта | 0

### 5 ИСХОДНЫЙ КОД
**main.cpp**
```c++
#include <iostream>
using namespace std;
#include "311.h"

int main() {
  int size;
  
  cin >> size;
  if (size <= 4) {
    cout << size << "?";
    return 0;
  }  
  MyClass *obj1 = new MyClass(size);
  
  cin >> size;
  if (size <= 4) {
    cout << size << "?";
    return 0;
  }  
  MyClass *obj2 = new MyClass(size);

  (*obj1).print();
  obj1 = obj2;
  cout << endl;
  (*obj1).print(); 
  return(0);
}
```
              
**311.h**
```c++
#ifndef MYCLASS_H
#define MYCLASS_H


class MyClass {
  public:
    int sizePrint;
    int *arr;
    MyClass(int size) {
      sizePrint = size;
      arr = new int[size];
      for (int i = 0; i < size; i++) {
        arr[i] = size;
      }
    }
    void print() {
      for(int i = 0; i < sizePrint; i++) {
        if (i != sizePrint - 1)
          cout << arr[i] << "  ";
        else
          cout << arr[i];
      }
   }
};
#endif              
```
### 2 вариант (частично нерабочий)
**main.cpp**
```c++
#include "311old.h"
#include <iostream>
using namespace std;
int main() {
  int size;
  
  cin >> size;
  MyClass *obj1 = new MyClass(size);
  if (size <= 4) {
    cout << size << "?";
    return 0;
  }
  
  cin >> size;
  MyClass *obj2 = new MyClass(size);
  if (size <= 4) {
    cout << size << "?";
    return 0;
  }
  
  int *temp = obj1 -> arr;
  int a = obj1 -> n;
  obj1 = obj2;
  
  for (int i = 1; i <= a; i++) {
    if (i != a)
      cout << temp[i-1] << " ";
    else
      cout << temp[i-1];
  }
  
  cout << endl;
  obj1 -> print();
  return(0);
}


MyClass::MyClass(int size) {
  n = size;
  arr = new int[size];
  for (int i = 0; i < size; i++) {
    arr[i] = size;
  }
}

void MyClass::print() {
  for(int i = 1; i <= n; i++) {
    if (i != n)
      cout << arr[i-1] << " ";
    else
      cout << arr[i-1];
  }
}
```
  
**311old.h**
```c++
#ifndef __MYCLASS_H__
#define __MYCLASS_H__
class MyClass {
  public:
    MyClass(int size);
    int *arr;
    int n;
    void print();
};
#endif  
```
